<a href="https://colab.research.google.com/github/jayac251/Machine_Learning/blob/main/Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Loading Data in Pandas**

**Kaggle link:** https://www.kaggle.com/c/Titanic/data

**Dataset:** https://github.com/jayac251/Machine_Learning/blob/main/Datasets/titanic.csv

**Description for the data**
-------------------------------

**survival:**This tells us whether a given person survived (0 = No, 1 = Yes).

**pclass:**This is a proxy for socio-economic status, where first class is upper, second class is middle, and third class is lower status.

**sex:**This tells us whether a given person is male or female.

**age:** This is a fractional value if less than 1; for example, 0.25 is 3 months. If the age is estimated, it is in the form of xx.5.

**sibsp:** A sibling is defined as a brother, sister, stepbrother, or stepsister, and a spouse is a husband or wife.

**parch:** A parent is a mother or father, while a child is a daughter, son, stepdaughter, or stepson. Children that traveled only with a nanny did not travel with a parent. Thus, 0 was assigned for this field.

**ticket:** This gives the person's ticket number.

**fare:** This is the passenger's fare.

**cabin:** This tells us the passenger's cabin number.

**embarked:** The point of embarkation is the location where the passenger boarded the ship.

## **Exercise 1.01: Loading and Summarizing the Titanic Dataset**

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

https://pandas.pydata.org/pandas-docs/stable/reference/frame.html



# First 5 sample of the data

In [12]:
# mounting google drive
from google.colab import drive
drive.mount("/gdrive")
import pandas as pd

Drive already mounted at /gdrive; to attempt to forcibly remount, call drive.mount("/gdrive", force_remount=True).

In [13]:
df = pd.read_csv("/gdrive/My Drive/Colab Notebooks/titanic.csv")
df.head()

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0
3           3  C123        S  53.1000  ...      0  female      1      1.0
4           4   NaN        S   8.0500  ...      0    male      0      0.0

[5 rows x 12 columns]

**Reading first 10 rows**

In [9]:
df.head(10)

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0
3           3  C123        S  53.1000  ...      0  female      1      1.0
4           4   NaN        S   8.0500  ...      0    male      0      0.0
5           5   NaN        Q   8.4583  ...      0    male      0      0.0
6           6   E46        S  51.8625  ...      0    male      0      0.0
7           7   NaN        S  21.0750  ...      1    male      3      0.0
8           8   NaN        S  11.1333  ...      2  female      0      1.0
9           9   NaN        C  30.0708  ...      0  female      1      1.0

[10 rows x 12 columns]

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html

**DataFrame.describe(percentiles=None, include=None, exclude=None, datetime_is_numeric=False)**

Generate descriptive statistics.

Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.

Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types.

In [4]:
df.describe(include='all')

         Unnamed: 0        Cabin Embarked  ...   Sex        SibSp    Survived
count   1309.000000          295     1307  ...  1309  1309.000000  891.000000
unique          NaN          186        3  ...     2          NaN         NaN
top             NaN  C23 C25 C27        S  ...  male          NaN         NaN
freq            NaN            6      914  ...   843          NaN         NaN
mean     654.000000          NaN      NaN  ...   NaN     0.498854    0.383838
std      378.020061          NaN      NaN  ...   NaN     1.041658    0.486592
min        0.000000          NaN      NaN  ...   NaN     0.000000    0.000000
25%      327.000000          NaN      NaN  ...   NaN     0.000000    0.000000
50%      654.000000          NaN      NaN  ...   NaN     0.000000    0.000000
75%      981.000000          NaN      NaN  ...   NaN     1.000000    1.000000
max     1308.000000          NaN      NaN  ...   NaN     8.000000    1.000000

[11 rows x 12 columns]

**Removing the unnamed column**

In [16]:
del df['Unnamed: 0']
df = df[df.columns[1:]] # Use the columns
df.head()

  Embarked     Fare  Pclass            Ticket  ...  Parch     Sex  SibSp Survived
0        S   7.2500       3         A/5 21171  ...      0    male      1      0.0
1        C  71.2833       1          PC 17599  ...      0  female      1      1.0
2        S   7.9250       3  STON/O2. 3101282  ...      0  female      0      1.0
3        S  53.1000       1            113803  ...      0  female      1      1.0
4        S   8.0500       3            373450  ...      0    male      0      0.0

[5 rows x 10 columns]

Pandas **dataframe.mean()** function return the mean of the values for the requested axis.

In [17]:
df.mean()

Fare        33.295479
Pclass       2.294882
Age         29.881138
Parch        0.385027
SibSp        0.498854
Survived     0.383838
dtype: float64

The **Pandas std(**) is defined as a function for calculating the standard deviation of the given set of numbers, DataFrame, column, and rows. requested axis

In [18]:
df.std()

Fare        51.758668
Pclass       0.837836
Age         14.413493
Parch        0.865560
SibSp        1.041658
Survived     0.486592
dtype: float64